{
  "$comment": "PROLOGUE SEQUENCE: Meet Dr. Winifred Burkle",
  "UniqueID": "apartment_winifred_001_sequence",
  "Title": "Meet Winifred",
  "SceneType": "sequence",
  "Location": "appartmentlobby_lc_001",
  "Repeatable": false,
  "ChunkByParagraphs": true,
  "ParagraphsPerPage": 2,
  "Trigger": {
    "EventType": "Triggered by event (manual)",
    "AttachedTo": "room",
    "EntityID": "appartmentlobby_lc_001"
  },
  "Stages": [
    {
      "StageID": "stage_01",
      "Text": "Hurrying down the stairs you realize you're going to be late for your first day. You heard stories about what the good doctor does to his tardy employee's and you were not going to find out! <Shit, shit, shit, I gotta hurry I gotta...Whaaaaa?>\n\nSLAM! CRASH!\n\nYou were in such a rush you hadn't noticed the woman in red, standing with her back to you at the bottom of the stairs.\n\nSpilling her coffee all over the lobby floor. \"WHAT THE HELL FUCKING MOVE ALREADY WOULD YA?\" You shout.\n\n\"....excuse me?\" says a quiet feminine voice from in front of you.",
      "NextStage": "stage_02"
    },
    {
      "StageID": "stage_02",
      "Text": "\"Hey there asshole! Maybe you don't know this but it's rude to throw a ladies coffee on the floor before she had a chance to try it!\" Says the young woman half joking half serious. You blush. The opposite sex alway made you nervous and this times no different.\n\n\"Oh! Um uhhh......\" The room goes silent and you're just staring at her like a idiot! <Shit say something! Anything! Come on THINK!> \" I'm so sorry! I never am ...uhhh.look ... Im late and I....uhhhh.....I just have to go ok...\" You stammer out loud trying to pass her but you trip on the last step taking quite a fall.\n\n<Great job Steve! You're late on your first day and now your first encounter with a female not at work.... And she thinks you are a fucking idiot.>",
      "NextStage": "stage_03"
    },
    {
      "StageID": "stage_03",
      "Text": "------------\n\n<This day is all gone to hell! I should just go back to bed. Why does this alway happen to me? This is too embarrassing to continue.... Wait is she smiling at me....? It's a really cute smile....>\n\nNervously glancing up at her face the woman is smirking at you. She's still staring you down but has a forgiving look on her face. Flashing you a warm smile she offers you a hand up.\n\n\"Sorry...I can be a real bitch with out my morning caffeine. Hey its just a cup of coffee no reason to kill yourself or anything. Are you alright?\" Helping you back to your feet you just nod. Still kind of speechless.\n\n\"Where are you so late to anyway?\" she asks. \"E.I. it's my first day.\" \"HAHAH! I love a newbies first day. Should be fun to watch!\" She replies.\n\n\"Wait you work for E.I?\"\n\n\"Nothing gets past you Einstein! I'm Dr. Winifred Burkle and I head up our exotic science division. It's very nice to meet you!\"",
      "NextStage": "stage_04"
    },
    {
      "StageID": "stage_04",
      "Text": "--------------\n\n\" I don't want to hold you up any longer... but ......\nWe still have this matter of my spilled coffee. What'cha gonna do about that Mr.....?\"\n\n\"Wolf, Steven Wolf.\"\n\n\"Well Mr. Wolf.....?\n\n\"May I buy you another cup? I think there's a cafe on the west side.\" \"Already forget about being late? Tell you what.... you find me and my lab we'll go get coffee together and you can tell me all about your first day.\"\n\n\"Deal! Where's your lab?\" \"Ha yeah right wheres the fun if I just tell you? Ask your \"co-workers\" for hints. Now You better go , bye!\" With that Winifred waves and walks up stairs. Your eyes look back catching a glimpse of her tight pert ass and leave for work.\n\nOBJECTIVES UPDATED!\nEvil Inc Quest: Find Winifred Burkle's Lab\nTry asking your co-workers!\n\nThe reception to your apartment buildings. People are constantly coming and going.",
      "Effects": [
        {
          "cmdtype": "CT_SETVARIABLE",
          "CommandPart2": "player.Stats.winifred_lab_stage",
          "CommandPart3": "Equals",
          "CommandPart4": 1
        }
      ],
      "IsEnd": true
    }
  ]
}
